#include <bits/stdc++.h>

using namespace std;
string s0[6]={
    "",".....",".***.",".***.",".***.","....."
};
string s1[6]={
    "","****.","****.","****.","****.","****."
};
string s2[6]={
    "",".....","****.",".....",".****","....."
};
string s3[6]={
    "",".....","****.",".....","****.","....."
};
int main()
{
    string s;
    cin >> s;
    int x=s.size()-1;
    int cnt=0;
    while (cnt<6)
    {
        for(int i=0;i<=s.size();i++)
        {
            if(s[i]=='0')
            {
                cout << s0[cnt+1];
            }
            if(s[i]=='1')
            {
            cout << s1[cnt+1];
            }
            if(s[i]=='2')
            {
                cout << s2[cnt+1];
            }
            if(s[i]=='3')
            {
                cout << s3[cnt+1];
            }
        }
        cout << endl;
        cnt++;
    }
    //乱花渐欲迷人眼，浅草才能没马蹄，最爱湖东行不足，绿杨阴里白沙堤
    //东临碣石 以观沧海，水何澹澹，山岛竦峙，树木丛生，百草丰茂，秋风萧瑟，洪波涌起
    //日月之行，若出其中，星汉灿烂，若出其里，幸甚至哉，歌以咏志
    //自古高云簇此城，秋风吹散马蹄声，河流大野犹嫌束，山入潼关不解平
    
    //system("pause");
    return 0;
}
